# Introduction

Pandas (in addition to Numpy) is the go-to Python library for all your data science needs. It helps with dealing with input data in CSV formats and with transforming your data into a form where it can be inputted into ML models. However, getting comfortable with the ideas of dataframes, slicing, etc was very tough for me in the beginning.

In [1]:
# !pip install pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
dff = pd.DataFrame([100, 101, 102])
dff

     0
0  100
1  101
2  102

In [4]:
dff = pd.DataFrame([[100, 101],[10, 11, 12]])
dff

     0    1     2
0  100  101   NaN
1   10   11  12.0

In [5]:
dff = pd.DataFrame({'id':[100, 101, 102],
                   'color':['red', 'blue', 'red']},
                  )
dff

    id color
0  100   red
1  101  blue
2  102   red

In [6]:
dff = pd.DataFrame({'id':[100, 101, 102],
                   'color':['red', 'blue', 'red']},
                    index=['a', 'b', 'c'])
dff

    id color
a  100   red
b  101  blue
c  102   red

# Loading in Data

In [7]:
df = pd.read_csv('example.csv')
# df = pd.read_excel('RegularSeasonCompactResults.xlsx')

# The Basics

In [8]:
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64  NaN      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [9]:
df.head(10)

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64  NaN      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0
5    1985      25   1218      79   1337      78    H      0
6    1985      25   1228      64   1226      44    N      0
7    1985      25   1242      58   1268      56    N      0
8    1985      25   1260      98   1133      80    H      0
9    1985      25   1305      97   1424      89    H      0

In [10]:
df.tail(7)

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145282    2016     131   1433      76   1172      54    N      0
145283    2016     131   1451      62   1285      59    N      0
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [11]:
df[:10]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64  NaN      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0
5    1985      25   1218      79   1337      78    H      0
6    1985      25   1228      64   1226      44    N      0
7    1985      25   1242      58   1268      56    N      0
8    1985      25   1260      98   1133      80    H      0
9    1985      25   1305      97   1424      89    H      0

In [12]:
df['Season']

0         1985
1         1985
2         1985
3         1985
4         1985
          ...
145284    2016
145285    2016
145286    2016
145287    2016
145288    2016
Name: Season, Length: 145289, dtype: int64

In [13]:
df.Season

0         1985
1         1985
2         1985
3         1985
4         1985
          ...
145284    2016
145285    2016
145286    2016
145287    2016
145288    2016
Name: Season, Length: 145289, dtype: int64

In [14]:
temp = df.copy()

In [15]:
temp['new'] = temp.Wscore + temp.Lscore
temp.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot  new
0    1985      20   1228      81   1328      64  NaN      0  145
1    1985      25   1106      77   1354      70    H      0  147
2    1985      25   1112      63   1223      56    H      0  119
3    1985      25   1165      70   1432      54    H      0  124
4    1985      25   1192      86   1447      74    H      0  160

In [16]:
temp.shape

(145289, 9)

## How do I handle missing values in pandas?

In [17]:
temp.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot  new
0    1985      20   1228      81   1328      64  NaN      0  145
1    1985      25   1106      77   1354      70    H      0  147
2    1985      25   1112      63   1223      56    H      0  119
3    1985      25   1165      70   1432      54    H      0  124
4    1985      25   1192      86   1447      74    H      0  160

In [18]:
temp.notnull().head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore   Wloc  Numot   new
0    True    True   True    True   True    True  False   True  True
1    True    True   True    True   True    True   True   True  True
2    True    True   True    True   True    True   True   True  True
3    True    True   True    True   True    True   True   True  True
4    True    True   True    True   True    True   True   True  True

In [19]:
temp.isnull().sum()

Season    0
Daynum    0
Wteam     0
Wscore    0
Lteam     0
Lscore    0
Wloc      1
Numot     0
new       0
dtype: int64

In [20]:
temp[temp.Wloc.isnull()].head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot  new
0    1985      20   1228      81   1328      64  NaN      0  145

In [21]:
temp['Wloc'] = temp['Wloc'].fillna(value='H')

In [22]:
temp.dropna(how='any', inplace=True)

## How do I use string methods in pandas?

In [23]:
temp.Wloc.replace('H', 'HH').head()

0    HH
1    HH
2    HH
3    HH
4    HH
Name: Wloc, dtype: object

In [24]:
temp.Wloc.str.lower().head()

0    h
1    h
2    h
3    h
4    h
Name: Wloc, dtype: object

In [25]:
temp.Wloc.replace('H', 'HH').str.lower().head()

0    hh
1    hh
2    hh
3    hh
4    hh
Name: Wloc, dtype: object

## How do I rename columns in a pandas DataFrame?

In [26]:
temp.rename(columns={'new':'Total_score'}, inplace=True)
temp.head(3)

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot  Total_score
0    1985      20   1228      81   1328      64    H      0          145
1    1985      25   1106      77   1354      70    H      0          147
2    1985      25   1112      63   1223      56    H      0          119

In [27]:
# temp.columns = ['a','b','c','d','e','f','g','h','i']
# temp.head(3)

In [28]:
temp.columns

Index(['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc',
       'Numot', 'Total_score'],
      dtype='object')

## How do I change the data type of a pandas Series?

In [29]:
temp.dtypes

Season          int64
Daynum          int64
Wteam           int64
Wscore          int64
Lteam           int64
Lscore          int64
Wloc           object
Numot           int64
Total_score     int64
dtype: object

In [30]:
temp.Season = temp.Season.astype(str)
temp.dtypes

Season         object
Daynum          int64
Wteam           int64
Wscore          int64
Lteam           int64
Lscore          int64
Wloc           object
Numot           int64
Total_score     int64
dtype: object

In [31]:
temp.Season.str.replace('1', '2').astype(float).mean()

2420.687815319811

In [32]:
df['Wloc'].value_counts()

H    86471
A    44229
N    14588
Name: Wloc, dtype: int64

In [33]:
df['Wloc'] = df.Wloc.astype('category')
df.dtypes

Season       int64
Daynum       int64
Wteam        int64
Wscore       int64
Lteam        int64
Lscore       int64
Wloc      category
Numot        int64
dtype: object

In [34]:
df.Wloc.cat.codes.head()

0   -1
1    1
2    1
3    1
4    1
dtype: int8

In [35]:
df.Wloc.cat.categories

Index(['A', 'H', 'N'], dtype='object')

In [36]:
df.shape

(145289, 8)

In [37]:
df.columns

Index(['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc',
       'Numot'],
      dtype='object')

In [38]:
df.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [39]:
df.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145289 entries, 0 to 145288
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Season  145289 non-null  int64
 1   Daynum  145289 non-null  int64
 2   Wteam   145289 non-null  int64
 3   Wscore  145289 non-null  int64
 4   Lteam   145289 non-null  int64
 5   Lscore  145289 non-null  int64
 6   Wloc    145288 non-null  category
 7   Numot   145289 non-null  int64
dtypes: category(1), int64(7)
memory usage: 7.9 MB

In [41]:
df.memory_usage(deep=True)

Index         128
Season    1162312
Daynum    1162312
Wteam     1162312
Wscore    1162312
Lteam     1162312
Lscore    1162312
Wloc       145571
Numot     1162312
dtype: int64

In [42]:
df.max()

C:\Users\Mohammad\AppData\Local\Temp/ipykernel_5692/1151452817.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Numot        6
dtype: int64

In [43]:
df['Wscore'].max()

186

In [44]:
df['Lscore'].mean()

64.49700940883343

In [45]:
df['Wscore'].argmin()

128582

In [46]:
df.Wloc.value_counts()

H    86471
A    44229
N    14588
Name: Wloc, dtype: int64

In [47]:
df.shape

(145289, 8)

In [48]:
df.Wloc.value_counts(normalize=True)

H    0.595170
A    0.304423
N    0.100407
Name: Wloc, dtype: float64

In [49]:
df.Wloc.value_counts().index

CategoricalIndex(['H', 'A', 'N'], categories=['A', 'H', 'N'], ordered=False, dtype='category')

In [50]:
df.Wloc.value_counts(normalize=True).values

array([0.59516959, 0.30442294, 0.10040747])

In [51]:
df.Wloc.nunique()

3

In [52]:
df['Wloc'].unique()

[NaN, 'H', 'N', 'A']
Categories (3, object): ['A', 'H', 'N']

## What do I need to know about the pandas index?

In [53]:
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64  NaN      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [54]:
df.index

RangeIndex(start=0, stop=145289, step=1)

In [55]:
df.set_index('Daynum', inplace = True)
df.head()

        Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
Daynum
20        1985   1228      81   1328      64  NaN      0
25        1985   1106      77   1354      70    H      0
25        1985   1112      63   1223      56    H      0
25        1985   1165      70   1432      54    H      0
25        1985   1192      86   1447      74    H      0

In [56]:
df.index.name = None
df.head()

    Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
20    1985   1228      81   1328      64  NaN      0
25    1985   1106      77   1354      70    H      0
25    1985   1112      63   1223      56    H      0
25    1985   1165      70   1432      54    H      0
25    1985   1192      86   1447      74    H      0

In [57]:
df.index.name = 'Daynum'
df.reset_index(inplace = True)
df.head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64  NaN      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0

# Acessing Values

In [58]:
df.iloc[[24970]]

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970      68    1991   1258     186   1109     140    H      0

In [59]:
df['Wscore'].argmax()

24970

In [60]:
df.iloc[[df['Wscore'].argmax()]]

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970      68    1991   1258     186   1109     140    H      0

In [61]:
df.loc[24970, 'Wteam']

1258

In [62]:
df.iloc[[df['Wscore'].argmax()]]['Lscore']

24970    140
Name: Lscore, dtype: int64

In [63]:
df.loc[24970, 'Lscore']

140

In [64]:
df.at[df['Wscore'].argmax(), 'Lscore']

140

# Sorting

In [65]:
df.head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64  NaN      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0

In [66]:
df.sort_values('Lscore', ascending=True).head()
# df.Lscore.sort_values().head()

        Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
100027      66    2008   1203      49   1387      20    H      0
49310       66    1997   1157      61   1204      21    H      0
89021       44    2006   1284      41   1343      21    A      0
85042       66    2005   1131      73   1216      22    H      0
103660      26    2009   1326      59   1359      22    H      0

# Filtering Rows Conditionally

In [67]:
df['Wscore'] > 150

0         False
1         False
2         False
3         False
4         False
          ...
145284    False
145285    False
145286    False
145287    False
145288    False
Name: Wscore, Length: 145289, dtype: bool

In [68]:
df[df['Wscore'] > 150]

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
5269       75    1986   1258     151   1109     107    H      0
12046      40    1988   1328     152   1147      84    H      0
12355      52    1988   1328     151   1173      99    N      0
16040      40    1989   1328     152   1331     122    H      0
16853      68    1989   1258     162   1109     144    A      0
17867      92    1989   1258     181   1109     150    H      0
19653      30    1990   1328     173   1109     101    H      0
19971      38    1990   1258     152   1109     137    A      0
20022      40    1990   1116     166   1109     101    H      0
22145      97    1990   1258     157   1362     115    H      0
23582      26    1991   1318     152   1258     123    N      0
24341      47    1991   1328     172   1258     112    H      0
24970      68    1991   1258     186   1109     140    H      0
25656      84    1991   1106     151   1212      97    H      0
28687      54    1992   1261     159   1319      86    H      0
35023     112    1993   1380     155   1341      91    A      0
40060      32    1995   1375     156   1341     114    H      0
52600      33    1998   1395     153   1410      87    H      0

In [69]:
df[(df['Wscore'] > 150) & (df['Lscore'] < 100)]

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
12046      40    1988   1328     152   1147      84    H      0
12355      52    1988   1328     151   1173      99    N      0
25656      84    1991   1106     151   1212      97    H      0
28687      54    1992   1261     159   1319      86    H      0
35023     112    1993   1380     155   1341      91    A      0
52600      33    1998   1395     153   1410      87    H      0

In [70]:
df[df.Daynum.isin([40, 41])].head()

     Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
407      40    1985   1102      85   1109      56    H      0
408      40    1985   1110      70   1162      56    N      0
409      40    1985   1112      82   1319      61    A      0
410      40    1985   1113      71   1462      67    H      0
411      40    1985   1114      76   1209      68    N      0

# Grouping

In [71]:
df.groupby('Wteam')

In [72]:
df.groupby('Wteam')['Wscore']

In [73]:
df.groupby('Wteam').Wscore.sum().head()

Wteam
1101     1406
1102    21597
1103    39285
1104    46178
1105    13418
Name: Wscore, dtype: int64

In [74]:
df.groupby('Wteam').Wscore.agg(['count', 'mean', 'min', 'max']).head()

       count       mean  min  max
Wteam
1101      18  78.111111   62   95
1102     309  69.893204   42  111
1103     518  75.839768   48  109
1104     609  75.825944   42  114
1105     179  74.960894   51  114

# Dataframe Iteration

In [75]:
for index, row in df[:10].iterrows():
    print(row['Wteam'])

1228
1106
1112
1165
1192
1218
1228
1242
1260
1305

# Extracting Rows and Columns

In [76]:
df[:10][['Wscore', 'Lscore']]

   Wscore  Lscore
0      81      64
1      77      70
2      63      56
3      70      54
4      86      74
5      79      78
6      64      44
7      58      56
8      98      80
9      97      89

## How do I remove columns from a pandas DataFrame?

In [77]:
df.drop(['Daynum', 'Wteam'], axis=1, inplace=False).head()

   Season  Wscore  Lteam  Lscore Wloc  Numot
0    1985      81   1328      64  NaN      0
1    1985      77   1354      70    H      0
2    1985      63   1223      56    H      0
3    1985      70   1432      54    H      0
4    1985      86   1447      74    H      0

In [78]:
df.drop([0, 2], axis = 0, inplace = False).head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
1      25    1985   1106      77   1354      70    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0
5      25    1985   1218      79   1337      78    H      0
6      25    1985   1228      64   1226      44    N      0

## save a DataFrame to disk

In [79]:
df.to_csv('df.csv', header=True, index=False)
# df.to_excel('res.xlsx',index=False)

In [80]:
#df = pd.read_csv('../Data/df_with_gensim_summaries.csv', nrows=10)

In [81]:
df.to_pickle('df.pkl')

In [82]:
pd.read_pickle('df.pkl').head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64  NaN      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0

##  How do I randomly sample rows from a DataFrame?

In [83]:
df.sample(n=3)

       Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
64068     107    2000   1365      86   1362      83    A      0
97625     129    2007   1322      85   1372      76    N      0
53488      63    1998   1365      89   1335      76    N      0

In [84]:
df.sample(n=3, random_state=42)

        Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
101566     100    2008   1329      93   1124      83    H      0
141343      41    2016   1199      75   1368      58    H      0
48348       35    1997   1314     106   1126      62    H      0

In [85]:
df.sample(frac=0.05, random_state=42)

        Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
101566     100    2008   1329      93   1124      83    H      0
141343      41    2016   1199      75   1368      58    H      0
48348       35    1997   1314     106   1126      62    H      0
120371      51    2012   1332      74   1341      66    H      0
97360      122    2007   1232      68   1229      65    N      0
...        ...     ...    ...     ...    ...     ...  ...    ...
56789       33    1999   1263      91   1135      72    A      0
15815       35    1989   1131      81   1132      69    H      0
26210       96    1991   1337      72   1362      57    H      0
83645       26    2005   1228      89   1211      72    N      0
130651      40    2014   1159      69   1107      60    A      0

[7264 rows x 8 columns]

## How do I create dummy variables in pandas?

In [86]:
df.Wloc.unique()

[NaN, 'H', 'N', 'A']
Categories (3, object): ['A', 'H', 'N']

In [87]:
df.Wloc.map({'N': 'Nit', 'H': "Heat", 'A': "Add"})

0          NaN
1         Heat
2         Heat
3         Heat
4         Heat
          ...
145284     Nit
145285     Nit
145286     Nit
145287     Nit
145288     Nit
Name: Wloc, Length: 145289, dtype: category
Categories (3, object): ['Add', 'Heat', 'Nit']

## How do I find and remove duplicate rows in pandas?

In [88]:
df.head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64  NaN      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0

In [89]:
df.duplicated().sum()

0

In [90]:
df.Season.duplicated()

0         False
1          True
2          True
3          True
4          True
          ...
145284     True
145285     True
145286     True
145287     True
145288     True
Name: Season, Length: 145289, dtype: bool

In [91]:
df.Season.duplicated().sum()

145257

In [92]:
df.Season.duplicated().count()

145289

In [93]:
df.drop_duplicates()

        Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0           20    1985   1228      81   1328      64  NaN      0
1           25    1985   1106      77   1354      70    H      0
2           25    1985   1112      63   1223      56    H      0
3           25    1985   1165      70   1432      54    H      0
4           25    1985   1192      86   1447      74    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145284     132    2016   1114      70   1419      50    N      0
145285     132    2016   1163      72   1272      58    N      0
145286     132    2016   1246      82   1401      77    N      1
145287     132    2016   1277      66   1345      62    N      0
145288     132    2016   1386      87   1433      74    N      0

[145289 rows x 8 columns]

## How do I apply a function to a pandas Series or DataFrame?

In [94]:
df['Wloc'] = df['Wloc'].fillna(value='H')
df.head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0      20    1985   1228      81   1328      64    H      0
1      25    1985   1106      77   1354      70    H      0
2      25    1985   1112      63   1223      56    H      0
3      25    1985   1165      70   1432      54    H      0
4      25    1985   1192      86   1447      74    H      0

In [95]:
df['temp_length'] = df.Wloc.apply(len)

In [96]:
df.head()

   Daynum  Season  Wteam  Wscore  Lteam  Lscore Wloc  Numot  temp_length
0      20    1985   1228      81   1328      64    H      0            1
1      25    1985   1106      77   1354      70    H      0            1
2      25    1985   1112      63   1223      56    H      0            1
3      25    1985   1165      70   1432      54    H      0            1
4      25    1985   1192      86   1447      74    H      0            1

In [97]:
def get_element(num):
    return num + 2

In [98]:
df['temp_length'] = df.temp_length.apply(get_element)
df.temp_length.head()

0    3
1    3
2    3
3    3
4    3
Name: temp_length, dtype: int64

In [99]:
df.temp_length = df.temp_length.astype(int) 
df.temp_length += 2
df.temp_length.head()

0    5
1    5
2    5
3    5
4    5
Name: temp_length, dtype: int32

In [100]:
df['temp_length 2'] = np.where(df['temp_length'] > 30, 1, 0)

In [101]:
df

,Daynum,Season,Wteam,Wscore,Lteam,Lscore,Wloc,Numot,temp_length,temp_length 2
0,20,1985,1228,81,1328,64,H,0,5,0
1,25,1985,1106,77,1354,70,H,0,5,0
2,25,1985,1112,63,1223,56,H,0,5,0
3,25,1985,1165,70,1432,54,H,0,5,0
4,25,1985,1192,86,1447,74,H,0,5,0
...,...,...,...,...,...,...,...,...,...,...
145284,132,2016,1114,70,1419,50,N,0,5,0
145285,132,2016,1163,72,1272,58,N,0,5,0
145286,132,2016,1246,82,1401,77,N,1,5,0
145287,132,2016,1277,66,1345,62,N,0,5,0
145288,132,2016,1386,87,1433,74,N,0,5,0

In [102]:
df1 = df[df.Wloc == "H"].sample(n=250)
df2 = df[df.Wloc == "A"].sample(n=250)

df_all = pd.concat([df1,df2])
df_all = df_all.sample(frac=1)
df_all

,Daynum,Season,Wteam,Wscore,Lteam,Lscore,Wloc,Numot,temp_length,temp_length 2
38865,108,1994,1406,86,1420,79,A,0,5,0
79752,47,2004,1280,66,1365,61,A,1,5,0
72521,96,2002,1147,61,1410,58,H,0,5,0
71653,75,2002,1271,60,1288,59,A,0,5,0
76677,83,2003,1407,66,1359,48,H,0,5,0
...,...,...,...,...,...,...,...,...,...,...
112602,112,2010,1151,78,1172,73,H,0,5,0
37147,68,1994,1390,75,1450,64,H,0,5,0
69808,25,2002,1179,73,1331,68,A,0,5,0
99467,48,2008,1450,75,1226,45,A,0,5,0
128274,110,2013,1125,81,1325,62,H,0,5,0